#include <iostream>

using namespace std;

int main() {
	/* 스트림:  소프트웨어인 프로그램과 하드웨어인 기계는 서로 연결되어있지 않은데 이런 상태를 ... 
	 스트림은 단방향성을 띄기 때문에 입, 출력 스트림을 별도로 생성하여 관리해야한다.
	 입력버퍼, 출력버퍼 (이거 옛날에 정리했던거 다시 찾아보기)

	 버퍼의 필요성: 데이터의 송수신의 효율성 떄문에 필요

	 콘솔 표준 입출력의 스트림 종류
	 - stdin: 표준 입력 스트림(기본 키보드 대상)	
	 - stdout: 표준 출력 스트임(기본 모니터 대상)
	 - stderr: 표준 에러 스트림(기본 모니터 대상이지만 우리가 보지 못함)

	 콘솔에 출력을 하건 파일에 출력을하건 출력에는 두가지 모드가있다.
	 - 텍스트모드 ( 텍스트로 출력함)
	 - 바이너리 모드( 2진수 형태로 표현됨)

	 쓸데없는 함수 배울거임 >< (c언어 기반의 함수.. 할튼 오늘 이후로 거의 안쓸거임)
	 - 단일문자 출력함수(아스키 코드 한글자 출력) putchar(), fputc()
		 - putchar() : 콘솔입출력에서만 사용가능
		- fputc() :  모든입출력에 사용가능
	- 단일 문자 입력받는 함수
		- getchar(): 이거 엔터도 문자로 먹어서 입력씹힐수있음. 버퍼 비우기 필요
		- fgetc():

	EOF : 파일의 끝을 표현하기 위해 정의해놓은 상수(-1) 
	

	 // 
	 */

	// 
}